{"\u0120recently": 35828, ",": 255, "\u0120when": 40089, "\u0120i": 31074, "\u0120try": 39109, "\u0120to": 38783, "\u0120use": 39633, "\u0120cuda": 27677, "\u0120programming": 35341, "\u0120want": 39955, "\u0120send": 36998, "\u0120a": 24521, "\u0120vector": 39756, "\u0120gpu": 30483, "\u0120memory": 33022, ".": 293, "\u0120someone": 37525, "\u0120tells": 38490, "\u0120me": 32960, "\u0120that": 38583, "\u0120can": 26338, "\u0120thrust": 38682, "::": 3583, "device": 8319, "_": 3774, "vector": 22499, "\u0120and": 25065, "host": 11704, "\u0120also": 24975, "\u0120read": 35741, "\u0120the": 38587, "\u0120help": 30803, "\u0120document": 28617, "\u0120but": 26261, "\u0120still": 37869, "\u0120don": 28648, "'t": 125, "\u0120know": 32193, "\u0120how": 30992, "\u0120such": 38135, "\u0120into": 31773, "\u0120kernel": 32126, "\u0120function": 30180, "\u0120": 23853, "\u0120my": 33505, "\u0120codes": 26852, "\u0120are": 25258, "\u0120as": 25326, "\u0120following": 29946, ":": 3567, "\u0120in": 31280, "\u0120fact": 29578, "\u0120if": 31129, "\u0120you": 40410, "\u0120please": 34882, "\u0120tell": 38488, "\u0120something": 37529, "\u0120about": 24554, "\u0120this": 38635, "\u0120question": 35613, "\u0120there": 38606, "\u0120any": 25130, "\u0120better": 25836, "\u0120way": 39998, "\u0120complete": 27025, "\u0120same": 36724, "?": 3676, "\u0120thanks": 38582, "\u0120very": 39806, "\u0120much": 33421, "!": 0, "thrust": 21144, "&": 92, "lt": 14334, "int": 12565, "gt": 11268, "dev": 8305, "fi": 10223, "ret": 18539, "ime": 12196, "[": 3709, "1000": 1117, "]": 3733, "global": 11069, "void": 22686, "compute": 7174, "current": 7701, "d": 7768, "ftime": 10692, "idx": 12002, "=": 3623, "block": 5832, "dim": 8421, "x": 23188, "*": 217, "+": 231, "thread": 21122, "printf": 17478, "\"": 29, "%": 82, "\\": 3721, "n": 15386, "\u0120device": 28283, "\u0120vectors": 39762, "\u0120cannot": 26349, "\u0120be": 25730, "\u0120passed": 34552, "\u0120directly": 28400, "\u0120kernels": 32127, "\u0120need": 33630, "\u0120pass": 34550, "\u0120pointer": 34918, "\u0120underlying": 39322, "\u0120done": 28649, "\u0120like": 32485, "\u0120have": 30750, "\u0120an": 25030, "\u0120array": 25298, "\u0120of": 34026, "\u0120do": 28603, "\u0120what": 40082, "\u0120is": 31889, "\u0120described": 28170, "\u0120here": 30815, "raw": 18032, "pointer": 17199, "cast": 6418, "data": 7887, "\u0120hierarchy": 30849, "\u0120src": 37711, "/": 343, "main": 14459, "rs": 18836, "animal": 4627, "s": 19016, "race": 17951, "\u0120ar": 25236, "ror": 18770, "\u0120add": 24714, "\u0120modules": 33303, "\u0120properly": 35392, "\u0120so": 37485, "\u0120no": 33754, "\u0120errors": 29235, "mod": 14976, "animals": 4628, "fn": 10453, "let": 13776, "12": 1259, "0": 377, "1": 1114, "8": 3184, "24": 1781, "white": 22928, "println": 17480, "hello": 11536, "world": 23079, "pub": 17687, "struct": 20437, "height": 11527, "f64": 9949, "weight": 22874, "age": 4289, "u32": 21738, "t": 20766, "enum": 9475, "r": 17911, "ace": 4049, "wh": 22904, "it": 12898, "black": 5800, "yellow": 23418, "-": 273, "src": 20097, "5": 2554, "|": 23682, "^": 3769, "help": 11543, "name": 15417, "the": 21049, "file": 10255, "either": 9217, "or": 16321, "inside": 12525, "directory": 8445, "error": 9591, "aborting": 3970, "due": 8759, "to": 21285, "previous": 17450, "\u0120rename": 36164, "\u0120.": 24055, "\u0120find": 29787, "\u0120more": 33349, "\u0120information": 31470, "\u0120on": 34080, "\u0120splitting": 37668, "\u0120across": 24664, "\u0120files": 29764, "\u0120am": 24995, "\u0120trying": 39112, "\u0120connect": 27213, "\u0120messaging": 33062, "\u0120provider": 35438, "\u0120over": 34303, "\u0120secure": 36926, "\u0120connection": 27216, "\u0120using": 39659, "\u0120trust": 39074, "\u0120store": 37890, "\u0120unable": 39252, "\u0120unsecure": 39514, "ly": 14400, "\u0120post": 35021, "\u0120messages": 33061, "\u0120without": 40203, "\u0120issue": 31912, "\u0120moment": 33309, "\u0120connecting": 27215, "\u0120protocol": 35422, "\u0120it": 31921, "\u0120not": 33815, "\u0120working": 40249, "\u0120received": 35822, "\u0120error": 29231, "\u0120retrieving": 36413, "\u0120jndi": 32017, "\u0120\u0120": 40554, "\u0120works": 40253, "\u0120via": 39815, "\u0120jmeter": 32011, "\u0120password": 34558, "\u0120all": 24928, "\u0120valid": 39694, "\u0120correct": 27454, "\u0120seems": 36956, "\u0120initiating": 31520, "\u0120hermes": 30818, "\u0120through": 38671, "bat": 5510, "\u0120detecting": 28254, "\u0120parameters": 34482, "\u0120added": 24716, "\u0120start": 37796, "\u0120up": 39576, "\u0120therefore": 38610, "\u0120isn": 31898, "\u0120truststore": 39099, "\u0120updated": 39583, "\u0120script": 36870, "\u0120line": 32505, "\u0120starts": 37802, "\u0120program": 35329, "\u0120tried": 39029, "\u0120sorts": 37554, "\u0120combinations": 26917, "\u0120with": 40197, "\u0120javax": 31981, "net": 15559, "ssl": 20125, "truststore": 21574, "(": 127, "password": 16788, ")": 173, "\u0120none": 33779, "\u0120them": 38593, "\u0120worked": 40241, "javax": 13095, "jms": 13172, "j": 13052, "ms": 15143, "exception": 9754, "could": 7438, "not": 15778, "create": 7523, "initial": 12450, "context": 7325, "jn": 13174, "di": 8362, "setup": 19455, "failed": 10010, "on": 16167, "sp": 19947, "server": 19403, "domain": 8611, "internal": 12627, "9001": 3383, "at": 5063, "hermes": 11561, "factory": 10000, "java": 13086, "282": 1897, "ext": 9874, "admin": 4212, "support": 20624, "discover": 8471, "destination": 8274, "configs": 7221, "441": 2391, "impl": 12230, "adapter": 4135, "82": 3235, "default": 8097, "112": 1231, "6": 2799, "browser": 6023, "tasks": 20861, "dis": 8453, "cover": 7463, "dest": 8272, "in": 12274, "ations": 5109, "task": 20859, "invoke": 12713, "77": 3098, "run": 18900, "175": 1480, "pool": 17245, "170": 1471, "lang": 13549, "745": 3062, "c": 6169, "program": 17560, "files": 10275, "x86": 23231, "jdk1": 13116, "7": 3005, "75": 3071, "bin": 5737, "w": 22748, "xx": 23372, "new": 15574, "size": 19718, "256": 1827, "m": 14405, "mx": 15279, "1024": 1157, "dhermes": 8359, "home": 11679, "opts": 16317, "log4j": 14215, "configuration": 7223, "props": 17608, "sun": 20604, "2d": 1949, "no": 15696, "dd": 7983, "true": 21544, "config": 7220, "xml": 23297, "libs": 13931, "djavax": 8531, "trust": 21555, "store": 20346, "alex": 4378, "jks": 13163, "manage": 14489, "'s": 124, "\u0120kind": 32167, "\u0120easy": 28854, "\u0120miss": 33206, ";": 3595, "\u0120before": 25762, "\u0120main": 32762, "\u0120class": 26712, "\u0120declaration": 27915, "\u0120essential": 29256, "y": 23386, "\u0120invoked": 31843, "\u0120two": 39178, "\u0120arguments": 25274, "\u0120its": 31944, "\u0120method": 33077, "\u0120wanted": 39956, "\u0120invoke": 31842, "\u0120java": 31974, "exe": 9769, "\u0120proper": 35391, "\u0120jks": 32007, "\u0120for": 29968, "\u0120example": 29341, "\u0120should": 37199, "\u0120work": 40237, "\u0120floats": 29895, "\u0120however": 30993, "\u0120filled": 29770, "\u0120zeros": 40429, "\u0120idea": 31089, "\u0120why": 40125, "\u0120required": 36281, "\u0120specifically": 37614, "\u0120allocate": 24936, "\u0120host": 30969, "\u0120?": 24458, "h": 11324, "vec": 22480, "float": 10404, "pd": 16850, "kernel": 13342, "grid": 11230, "cuda": 7668, "malloc": 14485, "memcpy": 14736, "\u0120cudamalloc": 27683, "\u0120cudamemcpy": 27686, "\u0120copy": 27435, "\u0120assignment": 25384, "\u0120just": 32083, "\u0120fine": 29792, "\u0120between": 25838, "\u0120containers": 27308, "\u0120(": 23959, "\u0120or": 34193, "std": 20252, "$": 77, "module": 15007, "load": 14174, "10": 1115, "cat": 6423, "really": 18129, "cu": 7658, "#": 61, "include": 12308, "cstdio": 7617, "if": 12028, "f": 9909, "1f": 1589, "2": 1622, "2f": 1958, "3": 1989, "3f": 2265, "4": 2285, "4f": 2528, "5f": 2769, "6f": 2990, "7f": 3160, "8f": 3368, "9": 3379, "9f": 3550, "01f": 568, "32": 2042, "synchronize": 20724, "reset": 18476, "return": 18564, "nvcc": 15912, "11": 1212, "arch": 4814, "sm": 19788, "52": 2602, "o": 15931, "100000": 1119, "200000": 1627, "300000": 1994, "400000": 2290, "500000": 2559, "00000": 381, "01": 531, "0000": 380, "\u0120simple": 37304, "\u0120code": 26835, "\u0120imports": 31256, "\u01202": 24187, "\u0120uses": 39658, "\u0120struct": 37958, "\u0120from": 30125, "\u0120at": 25439, "'m": 122, "\u0120functions": 30186, "\u0120bots": 26065, "trait": 21418, "\u0120gamecore": 30231, "board": 5866, "\u0120they": 38619, "\u0120both": 26060, "\u0120imported": 31253, "\u0120func": 30175, "\u0120maint": 32767, "rait": 17975, "\u0120resolved": 36335, "\u0120structure": 37963, "\u0120directory": 28402, "\u0120message": 33056, "\u0120where": 40091, "\u0120wrong": 40306, "\u0120diffirent": 28362, "\u251c\u2500\u2500": 40951, "bots": 5936, "\u2502": 40938, "\u2514\u2500\u2500": 40946, "game": 10805, "core": 7404, "use": 22251, "state": 20225, "bot": 5933, "dummy": 8765, "make": 14472, "turn": 21643, "get": 10934, "move": 15082, "amp": 4535, "self": 19313, "field": 10237, "empty": 9316, "rand": 17984, "'": 94, "a": 3796, "box": 5951, "mut": 15247, "uint": 21849, "side": 19609, "for": 10514, "random": 17988, "28": 1892, "resolve": 18489, "of": 16045, "undeclared": 21972, "`": 3789, "~": 23704, "unresolved": 22085, "\u0120rust": 36661, "\u0120by": 26270, "\u0120has": 30724, "\u0120good": 30450, "\u0120similar": 37295, "\u0120appropriate": 25214, "\u0120bits": 25908, "\u0120change": 26561, "\u0120guessing": 30611, "\u0120bit": 25890, "\u0120think": 38626, "\u0120reason": 35787, "\u0120haven": 30751, "\u0120really": 35774, "\u0120defined": 28006, "\u0120,": 24041, "\u0120instead": 31625, "\u0120generic": 30304, "\u0120happens": 30699, "\u0120implement": 31224, "\u0120call": 26317, "\u0120()": 23972, "\u0120provide": 35436, "\u0120enough": 29119, "\u0120disambiguate": 28426, "\u0120type": 39187, "\u0120let": 32372, ").": 193, "your": 23466, "and": 4580, "implementation": 12236, "signatures": 19635, "differ": 8399, "so": 19848, "i": 11827, "picked": 17036, "this": 21101, "one": 16183, "\u0120invitation": 31834, "\u0120link": 32516, "\u0120our": 34261, "\u0120own": 34363, "\u0120system": 38362, "\u0120api": 25150, "\u0120get": 30328, "\u0120token": 38803, "\u0120now": 33855, "\u0120problems": 35284, "\u0120\"": 23861, "403": 2298, "\u0120passing": 34554, "\u0120key": 32129, "\u0120well": 40070, "\u0120header": 30769, "\u0120request": 36270, "\u0120context": 27320, "\u0120documentation": 28618, "\u0120https": 31020, "://": 3575, "developers": 8315, "trustpilot": 21572, "com": 7054, "invitation": 12706, "api": 4718, "generate": 10888, "service": 19412, "review": 18583, "link": 14048, "apikey": 4722, "key": 13354, "\u0120map": 32841, "\u0120str": 37895, "\u0120reproduces": 36259, "\u0120other": 34254, "\u0120values": 39710, "\u0120note": 33823, "\u0120create": 27566, "\u0120new": 33687, "\u0120adding": 24719, "\u0120string": 37937, "\u0120literal": 32553, "v": 22348, "str1": 20357, "str2": 20358, "str3": 20359, "str": 20356, "res": 18465, "map": 14520, "place": 17110, "binary": 5739, "operation": 16277, "cannot": 6355, "be": 5589, "applied": 4769, "type": 21690, "\u0120owned": 34364, "\u0120case": 26409, "\u0120your": 40412, "\u0120literals": 32555, "'re": 123, "\u0120written": 40303, "\u0120binary": 25870, "\u0120together": 38795, "\u0120going": 30442, "\u0120make": 32779, "\u0120some": 37521, "\u0120s": 36697, "\u0120represent": 36244, "\u0120actual": 24693, "\u0120owning": 34370, "\u0120then": 38598, "\u0120slices": 37406, "\u0120one": 34084, "\u0120does": 28628, "\u0120sense": 37005, "string": 20403, "\u0120convert": 27395, "\u0120another": 25108, "\u0120problem": 35282, "\u0120expects": 29444, "\u0120resulting": 36391, "\u0120size": 37358, "\u0120alignment": 24921, "\u0120original": 34223, "\u0120fails": 29596, "\u0120runtime": 36653, "\u0120-": 24044, "\u0120demo": 28070, "\u0120several": 37101, "\u0120possible": 35018, "\u0120changes": 26566, "\u0120could": 27485, "\u0120declare": 27918, "\u0120would": 40270, "\u0120which": 40100, "\u0120will": 40153, "\u0120immediately": 31195, "\u0120free": 30093, "\u0120after": 24834, "\u0120creating": 27569, "\u0120output": 34286, "into": 12667, "iter": 12925, "collect": 7022, "\u0120package": 34383, "\u0120project": 35351, "\u0120folder": 29935, "\u0120far": 29638, "\u0120did": 28333, "\u0120cargo": 26389, "\u0120extern": 29540, "\u0120dependencies": 28116, "\u0120h": 30638, "ande": 4584, "led": 13710, "\u0120:": 24411, "\u0120lines": 32511, "\u0120compile": 27007, "\u0120(),": 23974, "\u0120doing": 28634, "\u0120even": 29295, "\u0120load": 32581, "\u0120crates": 27559, "\u0120than": 38578, "\u0120file": 29753, "\u0120edit": 28880, "\u01201": 24097, "\u0120solve": 37515, "sdl2": 19207, "cargo": 6396, "toml": 21317, "keyboard": 13361, "dependencies": 8194, "31": 2021, "extern": 9886, "crate": 7504, "keycode": 13363, "build": 6091, "e0433": 8897, "did": 8383, "you": 23463, "mean": 14689, "\u0120stated": 37810, "\u0120above": 24556, "\u0120root": 36564, "\u0120order": 34199, "lib": 13824, "scan": 19123, "code": 6977, "example": 9742, "below": 5651, "is": 12817, "pressed": 17437, "e": 8829, "event": 9712, "pump": 17704, "bool": 5901, "scancode": 19124, "\u0120been": 25759, "\u0120install": 31599, "\u0120windows": 40165, "\u0120sub": 38010, "sy": 20704, "tem": 20929, "\u0120linux": 32532, "wsl": 23143, "\u0120mentioned": 33031, "\u0120keeps": 32117, "\u0120erring": 29226, "\u0120answers": 25117, "\u0120mention": 33030, "\u0120around": 25292, "\u0120executed": 29383, "\u0120avail": 25560, "\u0120issues": 31918, "\u0120github": 30368, "\u0120pre": 35071, "\u0120ing": 31482, "\u0120didn": 28335, "\u0120means": 32967, "\u0120downloading": 28689, "from": 10663, "\u0120)": 24017, "\u0120running": 36651, "\u0120gives": 30374, "\u0120yet": 40400, "\u0120found": 30047, "\u0120lead": 32311, "\u0120being": 25790, "\u0120able": 24548, "\u0120wsl": 40318, "\u0120env": 29162, "\u012010": 24098, "\u0120ver": 39775, "\u012020": 24188, "rustup": 18986, "curl": 7695, "proto": 17620, "https": 11783, "tlsv1": 21258, "sf": 19469, "sh": 19484, "60": 2800, "certificate": 6570, "problem": 17510, "signed": 19637, "chain": 6630, "more": 15050, "details": 8293, "here": 11555, "ha": 11355, "se": 19212, "docs": 8587, "certs": 6581, "html": 11752, "verify": 22552, "le": 13676, "git": 11032, "ima": 12174, "cy": 7751, "therefore": 21072, "establish": 9648, "secure": 19255, "connection": 7249, "learn": 13695, "about": 3971, "situation": 19709, "how": 11725, "fix": 10349, "please": 17150, "visit": 22647, "web": 22846, "page": 16662, "mentioned": 14760, "above": 3972, "k": 13273, "insecure": 12513, "export": 9854, "rust": 18933, "hyper": 11820, "init": 12446, "\u0120certificate": 26515, "\u0120getting": 30340, "\u0120sh": 37113, "\u0120self": 36982, "\u0120since": 37330, "\u0120advent": 24784, "\u0120authorities": 25525, "\u0120almost": 24955, "\u0120nobody": 33756, "\u0120operates": 34142, "\u0120website": 40041, "\u0120because": 25750, "\u0120vulnerable": 39919, "\u0120man": 32794, "middle": 14846, "\u0120attacks": 25469, "\u0120exception": 29352, "\u0120seeing": 36948, "\u0120tampering": 38405, "\u0120non": 33774, "\u0120antivirus": 25127, "\u0120programs": 35342, "\u0120scan": 36797, "\u0120traffic": 38901, "\u0120out": 34266, "\u0120machine": 32738, "\u0120viruses": 39850, "\u0120intercept": 31687, "\u0120those": 38642, "\u0120connections": 27218, "\u0120insert": 31566, "\u0120authority": 25526, "\u0120impersonate": 31216, "\u0120doesn": 28629, "\u0120sees": 36958, "\u0120attack": 25465, "\u0120data": 27806, "\u0120most": 33356, "\u0120actually": 24695, "\u0120substantially": 38078, "\u0120weaken": 40008, "\u0120security": 36932, "\u0120choosing": 26640, "\u0120worse": 40265, "\u0120versions": 39798, "\u0120tls": 38775, "\u0120ciphers": 26665, "\u0120cases": 26412, "\u0120entirely": 29138, "\u0120neglecting": 33650, "\u0120verification": 39783, "\u0120leaving": 32333, "\u0120exposed": 29507, "\u0120mitm": 33233, "\u0120anyone": 25134, "\u0120internet": 31729, "\u0120event": 29298, "\u0120soon": 37540, "\u0120fail": 29591, "\u0120encrypted": 29069, "\u0120sni": 37474, "\u0120thing": 38622, "\u0120fix": 29836, "\u0120computer": 27095, "\u0120either": 28916, "\u0120disable": 28409, "\u0120feature": 29682, "\u0120remove": 36159, "\u0120rogue": 36547, "\u0120ca": 26287, "\u0120completely": 27028, "\u0120uninstall": 39393, "\u0120def": 27982, "ender": 9370, "\u0120prevent": 35214, "\u0120intercepting": 31688, "\u0120allow": 24944, "\u0120currently": 27723, "\u0120diving": 28574, "\u0120writing": 40302, "\u0120little": 32560, "\u0120math": 32908, "\u0120library": 32430, "\u0120quite": 35637, "\u0120model": 33271, "\u0120fields": 29739, "\u0120rings": 36507, "\u0120lifetimes": 32466, "\u0120right": 36497, "\u0120ring": 36505, "\u0120field": 29737, "\u0120compiling": 27014, "\u0120lifetime": 32464, "\u0120section": 36919, "by": 6149, "\u0120motivation": 33364, "\u0120behind": 25787, "\u0120obvious": 33977, "\u0120understand": 39329, "\u0120given": 30373, "\u0120examples": 29342, "\u0120totally": 38857, "\u0120lost": 32680, "\u0120btw": 26185, "\u0120minified": 33153, "\u0120version": 39795, "\u0120giving": 30375, "\u0120named": 33552, "\u0120impl": 31221, "\u0120various": 39732, "\u0120said": 36716, "\u0120may": 32936, "\u0120explain": 29469, "\u0120happening": 30698, "\u0120too": 38826, "\u0120specific": 37613, "\u0120traits": 38908, "ring": 18656, "characteristic": 6659, "unit": 22029, "some": 19895, "method": 14805, "15": 1400, "20": 1623, "explicit": 9843, "lifetime": 13996, "bound": 5943, "required": 18455, "\u0120king": 32173, "\u0120inheritance": 31490, "like": 14010, "\u0120pattern": 34579, "\u0120trait": 38906, "\u0120somehow": 37524, "\u0120interfaces": 31706, "\u0120provided": 35437, "\u0120languages": 32248, "\u0120only": 34092, "\u0120guaranty": 30601, "\u0120methods": 33083, "\u0120syntax": 38347, "\u0120mean": 32961, "\u0120superset": 38197, "\u0120implementing": 31231, "\u0120states": 37815, "\u0120implemented": 31228, "\u0120structs": 37960, "\u0120already": 24972, "\u0120yourself": 40414, "\u0120approach": 25208, "\u0120first": 29822, "\u0120define": 28005, "\u0120requires": 36285, "\u0120explanations": 29476, "\u0120strange": 37902, "\u0120wrote": 40308, "\u0120object": 33943, "\u0120reference": 35972, "\u0120peculiar": 34622, "\u0120require": 36280, "\u0120playing": 34875, "\u0120situation": 37354, "\u0120won": 40221, "\u0120play": 34865, "\u0120classic": 26714, "\u0120generics": 30308, "\u0120suffice": 38146, "\u0120look": 32648, "\u0120answer": 25113, "\u0120details": 28250, "foo": 10492, "bar": 5465, "value": 22412, "every": 9720, "false": 10029, "as": 4948, "well": 22883, "my": 15281, "first": 10331, "implement": 12235, "2i": 1966, "we": 22842, "override": 16583, "then": 21062, "can": 6338, "nothing": 15788, "keep": 13326, "\u0120learn": 32324, "\u0120wasm": 39973, "\u0120page": 34404, "\u0120input": 31552, "\u0120button": 26265, "\u0120player": 34869, "button": 6135, "\u0120tutorial": 39153, "\u0120closures": 26785, "\u0120put": 35528, "\u0120behavior": 25783, "\u0120click": 26744, "\u0120got": 30463, "\u0120compiler": 27009, "\u0120follows": 29948, "sys": 20742, "id": 11944, "player": 17140, "84": 3265, "closure": 6902, "wrap": 23103, "85": 3278, "input": 12498, "86": 3291, "87": 3311, "alert": 4375, "p": 16613, "favor": 10056, "infor": 12413, "me": 14687, "ome": 16148, "93": 3430, "94": 3440, "dyn": 8817, "expected": 9821, "an": 4546, "found": 10576, "@": 3705, "44": 2388, "14": 1359, "features": 10128, "gen": 10871, "element": 9247, "storage": 20344, "ot": 16458, "orage": 16325, "document": 8591, "expect": 9819, "should": 19577, "have": 11461, "num": 15879, "clicks": 6858, "else": 9274, "insert": 12517, "ref": 18242, "set": 19427, "onclick": 16179, "unchecked": 21955, "see": 19274, "comments": 7083, "clock": 6882, "why": 22940, "forget": 10535, "cdylib": 6506, "rlib": 18685, "ask": 4982, "ama": 4497, "wasm": 22804, "bindgen": 5747, "js": 13219, "37": 2169, "console": 7271, "panic": 16695, "hook": 11690, "version": 22566, "css": 7614, "style": 20476, "declaration": 8051, "dom": 8610, "token": 21302, "list": 14080, "target": 20854, "body": 5875, "location": 14194, "node": 15704, "window": 22979, "provides": 17635, "better": 5684, "debugging": 8030, "panics": 16698, "logging": 14222, "them": 21059, "with": 23015, "great": 11214, "development": 8316, "but": 6133, "requires": 18458, "all": 4412, "fmt": 10449, "panicking": 16697, "inf": 12390, "rastructure": 18018, "isn": 12854, "when": 22914, "deploy": 8201, "ing": 12421, "optional": 16311, "wee": 22869, "alloc": 4431, "tiny": 21228, "allocator": 4439, "that": 21047, "only": 16203, "compared": 7115, "slower": 19782, "than": 21042, "however": 11726, "unfortunately": 21996, "nightly": 15652, "now": 15806, "test": 20983, "profile": 17552, "release": 18340, "tell": 20926, "rustc": 18945, "optimize": 16301, "small": 19791, "opt": 16288, "level": 13795, "\u0120caused": 26449, "\u0120causes": 26450, "\u0120variable": 39718, "\u0120used": 39638, "\u0120closure": 26784, "\u0120contains": 27311, "\u0120cause": 26448, "\u0120contain": 27305, "\u0120references": 35974, "\u0120stored": 37891, "\u0120outside": 34294, "\u0120itself": 31945, "\u0120implicitly": 31241, "\u0120requirement": 36282, "\u0120variables": 39719, "\u0120second": 36910, "\u0120comparison": 26991, "\u0120replaced": 36215, "static": 20236, "once": 16174, "\u0120raw": 35713, "\u0120sockets": 37496, "\u0120c": 26286, "\u0120ending": 29081, "\u0120google": 30456, "\u0120available": 25562, "\u0120crate": 27556, "\u0120called": 26321, "\u0120pnet": 34907, "crates": 7508, "io": 12724, "pnet": 17176, "\u0120docs": 28611, "\u0120progress": 35343, "\u0120learning": 32328, "\u0120fun": 30174, "\u0120experience": 29449, "\u0120/": 24073, "++": 237, "\u0120complex": 27034, "\u0120paradigms": 34456, "\u0120background": 25623, "after": 4281, "),": 190, "\u0120n": 33538, "dimensional": 8425, "\u0120matrix": 32918, "\u0120practice": 35059, "\u0120development": 28277, "\u0120basic": 25698, "\u0120fill": 29769, "\u0120initializations": 31508, "\u0120forgive": 30000, "\u0120absent": 24562, "\u0120bound": 26074, "\u0120checking": 26607, "\u0120parameter": 34475, "\u0120testing": 38558, "\u0120ability": 24546, "\u0120fn": 29918, "\u0120thought": 38645, "\u0120option": 34186, "\u0120enum": 29152, "\u0120best": 25830, "\u0120accomplish": 24614, "\u0120space": 37573, "\u0120t": 38370, "\u0120automatically": 25549, "\u0120comes": 26928, "\u0120down": 28676, "\u0120set": 37084, "\u0120entries": 29146, "\u0120looked": 32651, "\u0120logic": 32626, "\u0120each": 28838, "\u0120ideally": 31091, "\u0120happen": 30695, "\u0120value": 39707, "\u0120changed": 26563, "\u01200": 24085, "\u012023": 24226, "which": 22921, "\u0120returning": 36426, "\u0120).": 24019, "\u0120finally": 29786, "\u0120vec": 39752, "\u0120spots": 37674, "\u0120open": 34109, "\u0120suggestions": 38161, "\u0120:)": 24413, "\u0120final": 29779, "\u0120thoughts": 38646, "\u0120research": 36301, "\u0120impls": 31246, "\u0120see": 36942, "\u0120typed": 39195, "\u0120sized": 37359, "\u0120useful": 39640, "\u0120unsure": 39539, "matrix": 14614, "option": 16307, "dimensions": 8426, "usize": 22281, "clone": 6889, "fill": 10282, "total": 21358, "len": 13746, "none": 15737, "index": 12345, "23": 1747, "ops": 16287, "indices": 12362, "output": 16554, "match": 14590, "su": 20480, "re": 18084, "what": 22906, "do": 8577, "mat": 14584, "null": 15874, "\u0120few": 29718, "\u0120ways": 40001, "\u0120idiomatic": 31112, "\u0120branch": 26100, "\u0120assume": 25405, "\u0120show": 37206, "\u0120index": 31379, "\u0120definition": 28011, "\u0120feel": 29697, "\u0120safe": 36708, "\u0120assumption": 25409, "\u0120mutable": 33479, "\u0120initialized": 31511, "\u0120unlike": 39423, "\u0120pointers": 34919, "\u0120point": 34915, "\u0120uninitialized": 39392, "\u0120return": 36424, "\u0120leads": 32313, "\u0120easiest": 28852, "\u0120user": 39647, "\u0120decide": 27901, "\u0120was": 39971, "\u0120close": 26775, "\u0120storing": 37893, "\u0120panic": 34443, "\u0120caller": 26323, "\u0120choose": 26638, "\u0120go": 30434, "\u0120further": 30199, "\u0120gent": 30315, "ifying": 12064, "\u0120next": 33700, "\u0120allows": 24952, "\u0120rather": 35705, "\u0120wrapping": 40286, "\u0120cleans": 26731, "\u0120nicely": 33713, "\u0120access": 24595, "\u0120initialization": 31507, "\u0120were": 40072, "\u0120optional": 34187, "\u0120capability": 26356, "\u0120themselves": 38597, "\u0120we": 40006, "\u0120always": 24994, "\u0120losing": 32674, "\u0120functionality": 30183, "\u0120suggestion": 38160, "\u0120common": 26953, "\u0120world": 40258, "\u0120whether": 40098, "\u0120implements": 31235, "\u0120default": 27983, "\u0120returns": 36427, "\u0120ad": 24699, "itional": 12965, "\u0120info": 31464, "\u0120comments": 26944, "\u0120traps": 38978, "'ve": 126, "\u0120fallen": 29615, "\u0120dimensions": 28385, "\u0120exist": 29415, "\u0120longer": 32642, "\u0120dimension": 28382, "\u0120created": 27567, "\u0120hasn": 30740, "\u0120statically": 37817, "\u0120static": 37816, "\u0120occur": 33993, "\u0120dynamic": 28831, "\u0120else": 28967, "\u0120these": 38614, "same": 19057, ")?": 204, "\u0120stack": 37754, "\u0120allocation": 24940, "\u0120arrays": 25303, "\u0120must": 33474, "\u0120deterministic": 28264, "\u0120time": 38727, "otherwise": 16474, "\u0120known": 32197, "\u0120heap": 30776, "\u0120leaves": 32332, "\u0120real": 35756, "\u0120options": 34190, "\u0120saying": 36779, "\u0120adds": 24733, "explanatory": 9842, "\u0120resized": 36329, "\u0120cost": 27481, "\u0120overhead": 34318, "\u0120'": 23930, "\u0120discriminate": 28480, "\u0120unsafe": 39503, "\u0120territory": 38543, "\u0120chunk": 26655, "\u0120big": 25854, "\u0120hold": 30910, "\u0120unsafely": 39505, "\u0120lot": 32681, "\u0120usually": 39663, "\u0120worth": 40267, "\u0120heavily": 30786, "\u0120optimized": 34180, "\u0120stores": 37892, "\u0120magic": 32752, "\u0120null": 33889, "\u0120macro": 32744, "\u0120part": 34520, "\u0120once": 34082, "\u0120cloned": 26772, "\u0120until": 39547, "\u0120extra": 29545, "\u0120interface": 31705, "\u0120smoother": 37455, "const": 7274, "sized": 19722, "maybe": 14651, "uninit": 22015, "\u0120having": 30753, "\u0120trouble": 39054, "\u0120uncrustify": 39305, "\u0120format": 30012, "\u0120lambdas": 32236, "\u0120turns": 39148, "\u0120lambda": 32235, "\u0120doe": 28627, "\u0120setting": 37091, "\u0120responsible": 36361, "\u0120positioning": 35006, "\u0120braces": 26093, "auto": 5217, "print": 17468, "qi": 17802, "unused": 22120, "q": 17781, "debug": 8027, "\u0120looking": 32652, "\u0120config": 27161, "\u0120settings": 37092, "\u0120assigning": 25383, "\u0120symbol": 38311, "\u0120additional": 24721, "\u0120newlines": 33695, "\u0120configured": 27170, "\u0120align": 24918, "\u0120sign": 37254, "\u01208": 24374, "30": 1990, "33": 2073, "\u0120changing": 26567, "\u0120maybe": 32937, "\u0120pair": 34419, "\u0120plausible": 34864, "\u0120might": 33117, "\u0120serious": 37060, "\u0120style": 38004, "\u0120re": 35730, "forms": 10553, "\u0120suitable": 38164, "\u0120statement": 37813, "\u0120keep": 32113, "\u0120single": 37334, "they": 21082, "\u0120stay": 37831, "\u01209": 24392, "64": 2875, "\u0120ensures": 29125, "align": 4397, "contin": 7330, "ued": 21816, "statements": 20232, "followed": 10485, "newline": 15584, "next": 15605, "line": 14028, "indent": 12341, "tab": 20805, "assign": 5024, "span": 19957, "aligning": 4401, "assignments": 5031, "don": 8620, "number": 15887, "threshold": 21133, "limit": 14015, "thresh": 21132, "\u0120import": 31249, "\u0120demonstrates": 28077, "\u0120rustc": 36668, "\u0120test": 38549, "\u0120least": 32330, "\u0120according": 24620, "\u0120.)": 24057, "buf": 6065, "strbuf": 20370, "16": 1431, "import": 12253, "there": 21070, "errors": 9596, "\u0120update": 39582, "\u0120latest": 32270, "\u0120nightly": 33730, "\u0120otherwise": 34256, "\u0120raii": 35667, "'d": 120, "\u0120delay": 28029, "\u0120dropping": 28751, "#,": 68, "\u0120gc": 30262, "alive": 4410, "\u0120prevents": 35218, "\u0120garbage": 30243, "\u0120collected": 26890, "\u0120essentially": 29257, "op": 16237, "\u0120perspective": 34712, "\u0120application": 25193, "\u0120guarantees": 30600, "\u0120flow": 29900, "\u0120mostly": 33357, "\u0120certain": 26508, "\u0120prefer": 35128, "\u0120convention": 27382, "\u0120recogn": 35842, "izable": 13036, "\u0120programmer": 35339, "func": 10720, "force": 10518, "deallocated": 8019, "does": 8599, "something": 19906, "were": 22888, "still": 20304, "would": 23088, "fail": 10009, "other": 16472, "\u0120drop": 28746, "\u0120explicitly": 29481, "\u0120moved": 33377, "\u0120signals": 37258, "\u0120developers": 28275, "\u0120destruction": 28229, "\u0120necessarily": 33622, "\u0120indicate": 31387, "\u0120comment": 26938, "\u0120had": 30651, "\u0120temporary": 38503, "\u0120needed": 33631, "mem": 14722, "drop": 8706, "tempfile": 20936, "tempdir": 20934, "temp": 20930, "dir": 8431, "things": 21093, "temporary": 20944, "without": 23018, "\u0120determine": 28260, "\u0120frusta": 30140, "\u0120intersect": 31758, "\u0120intersection": 31760, "\u0120100": 24099, "\u0120exact": 29331, "\u0120location": 32606, "\u0120touch": 38860, "\u0120position": 35003, "\u0120volume": 39888, "\u0120sort": 37548, "\u0120took": 38827, "\u0120separating": 37022, "\u0120axis": 25605, "\u0120theorem": 38600, "\u0120collision": 26900, "\u0120detection": 28255, "\u0120figure": 29748, "\u0120exactly": 29332, "\u0120anybody": 25131, "\u0120direction": 28395, "\u0120sat": 36753, "\u0120touching": 38863, "\u0120give": 30372, "\u0120percentage": 34658, "\u0120overlap": 34322, "\u0120calculate": 26304, "\u0120po": 34910, "hedron": 11519, "\u0120intersecting": 31759, "\u0120divide": 28569, "\u0120frustum": 30146, "\u0120calculating": 26308, "\u0120overlapping": 34323, "\u0120build": 26212, "\u0120bsp": 26172, "\u0120cs": 27649, "g": 10780, "\u0120operation": 34144, "\u0120intere": 31698, "section": 19249, "\u0120poly": 34952, "\u0120tetra": 38561, "hedrons": 11520, "\u0120volumes": 39889, "\u0120academic": 24579, "\u0120papers": 34452, "hedral": 11518, "ization": 13037, "\u0120representation": 36246, "\u0120assuming": 25408, "\u0120exists": 29423, "\u0120write": 40298, "\u0120boxed": 26085, "\u0120types": 39202, "merge": 14770, "a1": 3808, "a2": 3821, "implemented": 12239, "boxed": 5957, "\u0120advocate": 24803, "\u0120base": 25692, "\u0120implementation": 31226, "\u0120mutating": 33486, "\u0120provides": 35441, "\u0120flexibility": 29882, "\u0120notably": 33817, "\u0120efficient": 28904, "\u0120perform": 34664, "\u0120allocations": 24941, "\u0120oli": 34064, "obk": 15966, "\u0120ker": 32123, "\u0120points": 34923, "\u0120applies": 25197, "\u0120merges": 33045, "\u0120structures": 37966, "\u0120sets": 37087, "\u0120merged": 33044, "\u0120elements": 28937, "\u0120copyable": 27436, "\u0120addressed": 24729, "\u0120taking": 38394, "\u0120merge": 33043, "\u0120trick": 39021, "\u0120move": 33375, "\u0120box": 26084, "u8": 21748, "a3": 3830, "a4": 3838, "a7": 3871, "copy": 7395, "b": 5311, "extend": 9875, "b1": 5319, "b2": 5327, "b3": 5336, "b4": 5343, "b7": 5366, "\u0120contents": 27317, "\u0120dereferencing": 28146, "\u0120combine": 26921, "\u0120boxes": 26086, "\u0120inside": 31573, "\u0120cpu": 27531, "\u0120spent": 37645, "\u0120intended": 31666, "\u0120command": 26933, "\u0120compute": 27093, "\u0120crc": 27564, "\u0120implementations": 31227, "\u0120achieve": 24645, "\u0120intention": 31673, "\u0120interactions": 31682, "\u0120appears": 25176, "\u0120operate": 34140, "\u0120correctly": 27459, "\u0120consumes": 27299, "\u0120equivalent": 29200, "\u0120though": 38644, "\u0120compiled": 27008, "\u0120optimisations": 34169, "\u0120mac": 32735, "\u0120osx": 34252, "\u0120ssd": 37718, "\u0120executing": 29385, "\u0120eliminate": 28952, "\u0120impact": 31205, "cold": 7017, "\u0120buffers": 26203, "warm": 22794, "\u0120produces": 35309, "\u01204": 24287, "\u0120seconds": 36913, "\u0120cold": 26879, "\u0120less": 32367, "\u0120warm": 39960, "\u0120run": 36644, "\u012030": 24259, "\u0120util": 39667, "isation": 12826, "\u0120higher": 30851, "eg": 9195, "\u012025": 24240, "\u012080": 24375, "+%": 234, "\u0120expect": 29438, "\u0120come": 26927, "\u0120computation": 27089, "\u0120copying": 27437, "\u0120difference": 28347, "\u0120scanning": 36800, "gb": 10837, "\u0120xml": 40361, "\u0120mapping": 32845, "mb": 14653, "\u0120seen": 36957, "\u01203": 24258, "mmap": 14952, "crc": 7515, "crc32": 7517, "hasher": 11443, "cmp": 6950, "min": 14878, "env": 9486, "args": 4856, "fs": 10680, "metadata": 14794, "os": 16428, "unix": 22040, "fd": 10090, "slice": 19766, "parts": 16775, "time": 21192, "instant": 12549, "result": 18527, "filename": 10268, "nth": 15856, "unwrap": 22128, "t0": 20767, "open": 16246, "sz": 20761, "offset": 16058, "c32": 6211, "digest": 8409, "ieee": 12010, "while": 22923, "rem": 18359, "memory": 14743, "readable": 18098, "err": 9579, "kind": 13415, "write": 23116, "unsafe": 22088, "08": 706, "sum": 20590, "elapsed": 9234, "secs": 19245, "ok": 16093, "libc": 13836, "package": 16641, "authors": 5214, "gee": 10865, "edition": 9129, "2018": 1654, "keys": 13377, "their": 21056, "definitions": 8119, "doc": 8581, "org": 16360, "reference": 18253, "manifest": 14504, "syscall": 20743, "demo": 8170, "a77": 3878, "2d8": 1953, "c4": 6216, "978": 3489, "finished": 10314, "optimized": 16302, "debuginfo": 8031, "13": 1323, "running": 18917, "users": 22271, "lolo": 14241, "hash": 11436, "nil": 15655, "couldn": 7439, "defer": 8109, "close": 6896, "stat": 20224, "ck": 6797, "var": 22431, "off": 16049, "int64": 12576, "prot": 17612, "read": 18095, "shared": 19523, "somehow": 19900, "unmap": 22055, "sub": 20481, "seconds": 19238, "\u0120os": 34239, "\u0120specifics": 37617, "\u0120expose": 29506, "\u0120probably": 35277, "\u0120treat": 38995, "\u0120differently": 28354, "\u0120flag": 29847, "\u0120specified": 37618, "\u0120making": 32785, "\u0120syscall": 38358, "\u0120slower": 37426, "\u0120back": 25617, "non": 15732, "standard": 20196, "flags": 10371, "\u0120algorithm": 24906, "\u0120hackerrank": 30644, "\u0120times": 38736, "\u0120larger": 32256, "\u01205": 24312, "\u0120people": 34651, "\u0120who": 40116, "\u0120completed": 27026, "\u0120believe": 25795, "\u0120release": 36096, "\u0120mode": 33270, "\u0120speed": 37633, "ups": 22171, "\u0120missing": 33210, "\u0120gist": 30366, "\u0120game": 30230, "\u0120counter": 27491, "inp": 12496, "\u0120conditionally": 27148, "\u0120reduced": 35941, "\u0120based": 25694, "\u0120reduce": 35940, "\u0120winner": 40172, "\u0120chosen": 26645, "trim": 21518, "parse": 16746, "u64": 21745, "find": 10304, "winner": 22994, "win": 22965, "power": 17327, "two": 21671, "ri": 18626, "chard": 6662, "l": 13509, "ou": 16487, "ise": 12830, "stdin": 20259, "\u0120inner": 31540, "\u0120loop": 32658, "\u0120combination": 26916, "\u0120builtin": 26226, "\u0120allocating": 24939, "\u0120every": 29305, "\u0120slice": 37404, "\u0120returned": 36425, "count": 7441, "ones": 16188, "trailing": 21414, "zeros": 23542, "\u0120avoiding": 25577, "\u0120speeding": 37634, "\u0120per": 34654, "\u0120avoided": 25576, "\u0120supply": 38210, "\u0120alter": 24978, "\u0120borrows": 26056, "\u0120):": 24020, "\u0120modify": 33292, "\u0120improvement": 31274, "\u0120explicitness": 29482, "\u0120triggers": 39035, "\u0120buffered": 26200, "\u0120argument": 25273, "\u0120easier": 28851, "\u0120specify": 37623, "\u0120annotating": 25091, "\u0120mandatory": 32808, "\u0120borrow": 26047, "\u0120putting": 35530, "\u0120altogether": 24992, "\u0120bigger": 25856, "\u0120win": 40157, "might": 14854, "\u0120sufficient": 38148, "\u0120forget": 29997, "\u0120apply": 25198, "\u0120@": 24469, "jo": 13183, "hn": 11656, "\u0120advices": 24795, "'ll": 121, "free": 10628, "reader": 18104, "where": 22916, "bash": 5499, "\u0120cipher": 26664, "\u0120exercise": 29399, "\u0120exercism": 29402, "\u0120round": 36586, "ort": 16411, "ured": 22189, "\u0120manipulation": 32826, "\u0120grokked": 30566, "\u0120take": 38390, "\u0120fewer": 29719, "\u0120below": 25804, "\u0120important": 31251, "\u0120concept": 27116, "\u0120min": 33142, "up": 22138, "ulating": 21873, "\u0120involves": 31848, "\u0120outputting": 34291, "\u0120character": 26575, "\u0120characters": 26578, "\u0120included": 31312, "\u0120goes": 30440, "decode": 8063, "en": 9326, "cipher": 6773, "encode": 9351, "plain": 17123, "coded": 6984, "retain": 18544, "ascii": 4955, "alphanumeric": 4468, "lowercase": 14289, "spacing": 19953, "utf8": 22307, "bytes": 6159, "alphabetic": 4465, "122": 1267, "97": 3478, "spacer": 19951, "dec": 8032, "ipher": 12763, "out": 16526, "chars": 6666, "char": 6655, "counter": 7446, "spaces": 19952, "push": 17722, "\u0120place": 34840, "\u0120students": 37986, "\u0120search": 36896, "\u0120advice": 24793, "\u0120users": 39656, "\u0120made": 32747, "\u0120split": 37666, "\u0120executable": 29380, "\u0120large": 32254, "\u0120full": 30165, "\u0120definitions": 28012, "structs": 20446, "\u0120their": 38591, "\u0120prepend": 35161, "\u0120reduces": 35942, "\u0120readability": 35742, "\u0120pub": 35479, "\u0120decomp": 27929, "osing": 16441, "\u0120multiple": 33441, "derive": 8228, "serialize": 19387, "deserialize": 8259, "baz": 5528, "\u0120expected": 29442, "\u0120privacy": 35260, "\u0120boundary": 26076, "\u0120level": 32380, "\u0120module": 33301, "\u0120submodules": 38046, "\",": 41, "\u0120parent": 34497, "\u0120sibling": 37227, "\u0120permission": 34685, "\u0120typically": 39208, "\u0120invariants": 31812, "\u0120uphold": 39593, "\u0120public": 35480, "\u0120bounds": 26080, "\u0120preca": 35077, "ution": 22319, "\u0120programmers": 35340, "\u0120unusual": 39558, "\u0120thousands": 38648, "\u0120unless": 39422, "\u0120mirroring": 33182, "\u0120external": 29541, "\u0120consider": 27241, "\u0120auto": 25532, "generating": 10891, "\u0120coding": 26855, "\u0120defining": 28008, "\u0120&[": 23928, "u": 21719, "].": 3748, "\u0120wanna": 39954, "\u0120freely": 30099, "\u0120v": 39683, "\u0120=": 24441, "()": 139, "\u0120[": 24470, "],": 3746, "\u0120obviously": 33978, "\u0120couldn": 27486, "\u0120anything": 25135, "\u0120thank": 38579, "\u0120represented": 36250, "\u0120length": 32360, "\u0120integers": 31648, "\u0120records": 35879, "\u0120many": 32840, "\u0120hand": 30671, "\u0120literally": 32554, "\u0120amount": 25021, "\".": 44, "\u0120calls": 26327, "\u0120unsized": 39518, "\u0120limited": 32498, "\u0120referenced": 35973, "\u0120indirectly": 31404, "\u0120mutate": 33483, "\u0120discovered": 28469, "\u0120calling": 26326, "\u0120clones": 26773, "\u0120shared": 37139, "\u0120instance": 31609, "length": 13756, "\u0120pointing": 34920, "\u0120generally": 30295, "\u0120result": 36388, "\u0120fresh": 30113, "\u0120except": 29351, "\u0120tracks": 38891, "\u0120capacity": 26358, "\u0120allocated": 24937, "\u0120turning": 39147, "\u0120storage": 37888, "\u0120reused": 36432, "capacity": 6369, "\u0120discarded": 28444, "\u0120res": 36295, "uting": 22318, "\u0120again": 24841, "\u0120triple": 39043, "mutate": 15253, "through": 21137, "own": 16597, "mref": 15137, "end": 9364, "scope": 19164, "\u0120prints": 35251, "\u0120print": 35241, "\u0120opposite": 34158, "\u0120bug": 26207, "\u0120missed": 33207, "futures": 10759, "future": 10753, "stop": 20336, "tokio": 21309, "sync": 20720, "oneshot": 16189, "channel": 6648, "handler": 11397, "spawn": 19964, "join": 13192, "e0271": 8863, "mismatch": 14918, "resolving": 18493, "receiver": 18155, "recv": 18206, "note": 15783, "runtime": 18921, "threadpool": 21128, "\u0120surface": 38233, "\u0120associated": 25397, "\u0120inference": 31443, "\u0120directions": 28397, "\u0120sometimes": 37531, "\u0120wording": 40234, "\u0120fits": 29833, "\u0120expectations": 29441, "\u0120situations": 37355, "\u0120feels": 29700, "\u0120backwards": 25641, "\u0120course": 27507, "\u0120difficult": 28358, "\u0120mis": 33184, "\u0120reported": 36235, "\u0120cod": 26834, "\u0120human": 31033, "\u0120interpretation": 31742, "actual": 4118, "\u0120general": 30284, "\u0120agree": 24858, "\u0120confusing": 27198, "\u0120sure": 38231, "\u0120talked": 38397, "\u0120harm": 30716, "\u0120report": 36234, "\u0120followed": 29944, "\u0120guide": 30617, "\u0120draw": 28719, "\u0120lorenz": 32671, "\u0120extend": 29527, "\u0120switch": 38299, "\u0120substitute": 38080, "\u0120gl": 30376, "uortho": 22135, "\u0120gluperspective": 30420, "\u0120glfrustum": 30391, "\u0120unfortunately": 39362, "\u0120whatever": 40083, "\u0120useless": 39643, "\u0120while": 40102, "\u0120visualize": 39867, "\u0120window": 40162, "\u0120black": 25925, "background": 5409, "color": 7039, "gl": 11049, "clear": 6840, "0f": 763, "foreground": 10527, "pen": 16892, "02": 570, "enable": 9328, "blen": 5817, "ding": 8429, "blend": 5818, "alpha": 4462, "minus": 14904, "point": 17190, "smoothing": 19811, "mo": 14970, "oth": 16470, "viewport": 22618, "400": 2287, "projection": 17578, "camera": 6335, "mode": 14984, "identity": 11976, "glu": 11085, "ortho": 16416, "perspective": 16964, "45": 2412, "100": 1116, "sets": 19443, "frustum": 10677, "model": 14985, "view": 22613, "objects": 15960, "modelview": 14987, "buffer": 6069, "bit": 5770, "draw": 8688, "points": 17202, "begin": 5627, "go": 11110, "equ": 9519, "many": 14516, "times": 21210, "drawing": 8691, "each": 9027, "iteration": 12937, "iterations": 12938, "using": 22278, "strange": 20366, "attra": 5161, "ctor": 7641, "z": 23509, "sin": 19681, "cos": 7433, "save": 19100, "vertex3f": 22572, "swap": 20672, "buffers": 6077, "glut": 11087, "\u0120name": 33551, "\u0120misleading": 33199, "\u0120ever": 29304, "\u0120near": 33609, "\u0120wow": 40273, "\u0120complicated": 27042, "ious": 12750, "\u0120anyway": 25137, "\u0120nothing": 33829, "\u0120projection": 35354, "\u0120depth": 28133, "\u0120range": 35687, "\u0120perfectly": 34663, "\u0120likely": 32488, "\u0120generated": 30298, "\u0120lie": 32454, "\u0120z": 40419, "\u0120confined": 27174, "\u0120iirc": 31149, "\u0120attractor": 25484, "\u0120positive": 35008, "\u0120translation": 38951, "\u0120suggest": 38157, "\u0120things": 38624, "\u0120center": 26490, "\u0120viewing": 39826, "ldouble": 13674, "left": 13722, "right": 18645, "bottom": 5938, "top": 21338, "arc": 4812, "asm": 4988, "\u0120validate": 39695, "\u0120xades": 40336, "\u0120signature": 37259, "timestamp": 21214, "encoded": 9352, "\u0120block": 25958, "\u0120basically": 25699, "\u0120validation": 39699, "\u0120manually": 32835, "\u0120inspect": 31587, "\u0120timestamp": 38737, "especially": 9637, "\u0120certificates": 26517, "\u0120validity": 39702, "\u0120etc": 29270, "\u0120tool": 38828, "\u0120openssl": 34130, "\u0120bouncy": 26072, "\u0120castle": 26422, "\u0120generate": 30297, "\u0120timestamps": 38744, "\u0120bc": 25722, "\u0120serialize": 37051, "\u0120udp": 39227, "\u0120serialization": 37050, "\u0120lives": 32564, "\u0120end": 29073, "\u0120scope": 36839, "\u0120makes": 32784, "\u0120byte": 26275, "\u0120success": 38125, "\u0120playground": 34873, "serde": 19377, "json": 13225, "macro": 14438, "text": 21020, "returns": 18569, "abc": 3932, "e0597": 8929, "borrowed": 5923, "live": 14111, "long": 14245, "enough": 9420, "22": 1726, "lives": 14114, "until": 22113, "must": 15245, "valid": 22394, "anonymous": 4661, "defined": 8114, "19": 1539, "21": 1697, "\u0120outlive": 34281, "\u0120annotations": 25093, "\u0120explicit": 29479, "\u0120objects": 33947, "\u0120live": 32561, "\u0120stop": 37881, "strict": 20398, "\u0120assumptions": 25410, "\u0120ownership": 34368, "\u0120bytes": 26280, "\u0120borrowing": 26054, "\u0120candidate": 26347, "\u0120unfortunate": 39360, "\u0120luckily": 32717, "\u0120serde": 37041, "\u0120last": 32260, "\u0120long": 32640, "\u0120needs": 33637, "hi": 11582, "\u0120questions": 35618, "\u0120concerning": 27124, "\u0120port": 34985, "\u0120boost": 26031, "\u0120concepts": 27119, "):": 199, "\u0120x": 40334, "\u0120y": 40380, "\u0120immutable": 31201, "\u0120saw": 36777, "\u0120internals": 31725, "\u0120talks": 38399, "\u0120parametric": 34485, "\u0120mutability": 33478, "\u0120established": 29261, "\u0120rfc": 36479, "\u0120plans": 34857, "\u0120parametri": 34484, "zation": 23522, "\u0120numeric": 33904, "\u0120guest": 30613, "\u0120solution": 37512, "\u0120cleaner": 26727, "feature": 10125, "associated": 5039, "types": 21708, "point2d": 17193, "deriving": 8234, "show": 19581, "point2": 17192, "inline": 12483, "0i32": 772, "1i32": 1602, "immutable": 12221, "dereference": 8219, "template": 20937, "p1": 16618, "p2": 16624, "0u8": 801, "10u8": 1210, "\u0120expressed": 29514, "\u0120strong": 37951, "\u0120desire": 28208, "\u0120along": 24957, "\u0120aware": 25590, "\u0120core": 27442, "\u0120team": 38466, "\u0120definitely": 28010, "\u0120wants": 39958, "\u0120priority": 35258, "\u0120reformat": 36004, "\u0120separated": 37019, "\u0120three": 38664, "\u0120parts": 34545, "\u0120within": 40201, "\u0120parenthesis": 34500, "\u0120sed": 36940, "\u0120formatter": 30015, "\u0120care": 26381, "\u0120formatted": 30014, "double": 8644, "quaternion": 17857, "\u0120gnu": 30432, "\u0120indent": 31368, "\u0120snippet": 37481, "\u0120manual": 32834, "\u0120accessed": 24596, "np": 15812, "sl": 19742, "\u0120clang": 26700, "format": 10544, "\u0120kinda": 32168, "\u0120talk": 38396, "native": 15447, "2013": 1649, "\u0120showed": 37208, "\u0120promising": 35366, "\u0120results": 36392, "\u0120started": 37798, "\u0120regarding": 36023, "\u0120regex": 36029, "\u0120check": 26599, "\u0120matches": 32897, "\u0120text": 38565, "\u0120identical": 31094, "\u0120matching": 32898, "\u0120succeeded": 38120, "prelude": 17413, "regex": 18291, "reg": 18285, "quot": 17891, "space": 19950, "specify": 19988, "argument": 4862, "contents": 7322, "success": 20561, "\u0120couple": 27502, "\u0120indeed": 31364, "\u0120reading": 35749, "\u0120hunch": 31036, "\u0120encountering": 29062, "\u0120alex": 24898, "\u0120larionov": 32258, "\u0120pointed": 34916, "\u0120saved": 36772, "\u0120luck": 32716, "\u0120accept": 24587, "\u0120jpg": 32042, "\u0120images": 31176, "\u0120optimal": 34165, "\u0120arrangement": 25296, "\u0120paper": 34451, "...)": 320, "\u0120image": 31172, "\u0120optimally": 34166, "\u0120arranged": 25295, "/...": 363, "\u0120libraries": 32429, "\u0120suited": 38167, "\u0120jpeg": 32041, "width": 22950, "\u0120height": 30792, "\u0120resolution": 36333, "\u0120color": 26905, "\u0120profile": 35322, "\u0120operations": 34146, "github": 11034, "pistondevelopers": 17079, "image": 12176, "\u0120released": 36097, "cra": 7497, "btw": 6056, "\u0120bindings": 25878, "\u0120favourite": 29670, "\u0120export": 29502, "\u0120opengl": 34118, "\u0120console": 27256, "\u0120autocompletion": 25534, "\u0120constants": 27266, "\u0120ide": 31088, "visual": 22655, "\u0120studio": 37988, "\u0120sim": 37292, "generator": 10893, "\u0120copied": 27433, "\u0120global": 30405, "\u0120different": 28349, "functions": 10734, ".,": 310, "\u0120great": 30538, "\u0120printed": 35243, "bindings": 5750, "sdl": 19206, "video": 22606, "subsystem": 20542, "attr": 5158, "900": 3381, "700": 3007, "opengl": 16254, "resizable": 18482, "proc": 17516, "address": 4172, "loop": 14263, "42": 2346, "triggered": 21514, "128": 1307, "poll": 17223, "quit": 17888, "break": 5990, "registry": 18310, "fallback": 10025, "path": 16798, "nv": 15908, "command": 7072, "\u0120include": 31311, "\u0120lib": 32400, "\u0120includes": 31313, "\u0120lazy": 32302, "\u0120repeated": 36200, "graphics": 11203, "ka": 13282, "iser": 12834, "1989": 1561, "android": 4600, "\u0120framework": 30079, "concat": 7184, "anywhere": 4696, "lot": 14283, "constants": 7277, "array": 4911, "instance": 12543, "bind": 5743, "luint": 14364, "lenum": 13765, "lazy": 13624, "\u0120mainly": 32765, "\u0120javascript": 31979, "\u0120python": 35555, "\u0120developer": 28274, "\u0120oop": 34102, "\u0120wrap": 40281, "\u0120head": 30765, "\u0120especially": 29253, "\u0120tcp": 38454, "\u0120server": 37068, "streams": 20388, "\u0120asynchronously": 25435, "\u0120mio": 33174, "\u0120telling": 38489, "\u0120clue": 26795, "message": 14784, "\u0120whatnot": 40084, "\u0120relay": 36094, "\u0120workaround": 40239, "\u0120later": 32268, "\u0120design": 28195, "\u0120inherently": 31488, "\u0120flawed": 29873, "\u0120shows": 37211, "sock": 19858, "connections": 7252, "msg": 15156, "primitive": 17464, "request": 18449, "ips": 12774, "decoded": 8065, "noun": 15801, "ce": 6507, "bincode": 5742, "public": 17691, "unreachable": 22080, "\u0120holding": 30912, "\u0120indicated": 31388, "\u0120anymore": 25133, "\u0120fortunately": 30034, "lexical": 13805, "\u01202018": 24205, "\u0120hard": 30704, "\u0120simply": 37315, "\u0120fetch": 29714, "\u0120holds": 30913, "acqu": 4078, "ired": 12798, "\u0120iteration": 31933, "\u0120network": 33679, "\u0120relative": 36089, "\u0120performance": 34665, "\u0120penalty": 34644, "\u0120(?)": 24004, "\u0120negligible": 33651, "\u0120lack": 32224, "\u0120minimal": 33157, "able": 3960, "\u0120wasn": 39977, ".)": 303, "\u0120developing": 28276, "\u0120pwa": 35538, "\u0120submit": 38041, "\u0120twa": 39158, "\u0120cant": 26352, "\u0120manage": 32796, "\u0120hide": 30842, "\u0120url": 39623, "\u0120bar": 25676, "\u0120digital": 28372, "\u0120asset": 25374, "\u0120links": 32525, "\u0120tested": 38553, "\u0120connected": 27214, "\u0120successfully": 38128, "\u0120editor": 28885, "\u0120intent": 31672, "\u0120filter": 29774, "\u0120association": 25400, "\u0120assetlinks": 25375, "\u0120android": 25072, "\u0120manifest": 32816, "gradle": 11182, "\u0120app": 25162, "...": 313, "keytool": 13386, "printcert": 17474, "jarfile": 13080, "apk": 4727, "xmlns": 23303, "http": 11760, "schemas": 19147, "tools": 21334, "eu": 9682, "clubforceone": 6921, "mobile": 14972, "application": 4761, "allow": 4441, "backup": 5418, "icon": 11933, "mipmap": 14910, "ic": 11892, "launcher": 13602, "label": 13518, "app": 4736, "supports": 20627, "rtl": 